name: "CIFAR10_small"
force_backward: true
layer {
  name: "cifar"
  type: "Data"
  top: "data"
  top: "label"  
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    mean_file: "examples/cifar10/mean.binaryproto"
  }
  data_param {
    source: "examples/cifar10/cifar10_train_lmdb"
    batch_size: 100
    backend: LMDB
  }
}

layer {
  name: "cifar"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mean_file: "examples/cifar10/mean.binaryproto"
  }
  data_param {
    source: "examples/cifar10/cifar10_test_lmdb"
    batch_size: 100
    backend: LMDB
  }
  
}


layer {
  name: "batch_norm0"
  type: "BatchNorm"
  bottom: "data"
  top: "batch_norm0"
  param {
    lr_mult:0
  }
  param {
    lr_mult:0
  }
  param {
    lr_mult:0
  }
  batch_norm_param {    
    #use_global_stats: false
    #moving_average_fraction: 0.999
    #eps: 1e-5
  }
}

layer {
  name: "conv1"
  type: "GaussianConv"  
  bottom: "batch_norm0"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 50
    decay_mult: 0
  }
  param {
    lr_mult: 50
    decay_mult: 0
  }
  param {
    lr_mult: 5
    decay_mult: 0
  }
  # dummy - old depricated paramater
  param {
    lr_mult: 0
    decay_mult: 0
  }
  # bias
  param {
    lr_mult: 1
  }
  # set zero learning rate for blobs that are for debuging only
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  
  convolution_param {
    engine: CUDNN
    number_gauss: 2
    num_output: 96
    pad: 3
    kernel_size: 7
    stride: 1
    
    gmm_weight_normalization: false
    gmm_gauss_normalization: true
    gmm_mean_iteration_step: 1
    gmm_sigma_iteration_step: 1
    gmm_sigma_lower_bound: 0.5
    gmm_component_border_bound: 1.5
    
    weight_filler {
      type: "gaussian"
      #std: 0.144 # sqrt(1/(num-gauss*num-subfeatures)) for 2x2
      #std: 0.0001 # icpr16
      std: 0.01
      mean: 0
      #type: "constant"
      #value: 1
    }
    mu_filler {
      type: "uniform"
      min: 2
      max: 8
    }
    sigma_filler {
      type: "constant"
      value: 0.8     
      #value: 1.8
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "relu1"
  type: "ReLU"
  #type: "Sigmoid"
  bottom: "conv1"
  top: "relu1"
}
#layer {
#  name: "pool1"
#  type: "Pooling"
#  bottom: "relu1"
#  top: "pool1"
#  pooling_param {
#    pool: MAX
#    kernel_size: 3
#    stride: 2
#  }
#}

layer {
  name: "batch_norm1"
  type: "BatchNorm"
  bottom: "relu1"
  top: "batch_norm1"
  param {
    lr_mult:0
  }
  param {
    lr_mult:0
  }
  param {
    lr_mult:0
  }
  batch_norm_param {    
    #use_global_stats: false
    #moving_average_fraction: 0.999
    #eps: 1e-5
  }
}

layer {
  name: "conv2"
  type: "GaussianConv"
  bottom: "batch_norm1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 500
    decay_mult: 0
  }
  param {
    lr_mult: 500
    decay_mult: 0
  }
  param {
    lr_mult: 50
    decay_mult: 0
  }
  
  # dummy - old depricated paramater
  param {
    lr_mult: 0
    decay_mult: 0
  }
  # bias
  param {
    lr_mult: 1
    #decay_mult: 1
  }
  # set zero learning rate for blobs that are for debuging only
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  
  convolution_param {
    engine: CUDNN
    number_gauss: 2
    num_output: 96
    pad: 4
    kernel_size: 9
    stride: 1
    
    gmm_weight_normalization: false
    gmm_gauss_normalization: true # wasnt tried before when got 45%
    gmm_mean_iteration_step: 1
    gmm_sigma_iteration_step: 1
    gmm_sigma_lower_bound: 0.5
    gmm_component_border_bound: 1.5
    
    weight_filler {
      type: "gaussian"
      #std: 0.058 # sqrt(1/(num-gauss*num-subfeatures)) for 2x2
      std: 0.01
      mean: 0
      #type: "constant"
      #value: 1
    }
    mu_filler {
      type: "uniform"
      min: 2
      max: 8
    }
    sigma_filler {
      type: "constant"
      #value: 0.1
      value: 0.8
      #value: 1.8
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "relu2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "relu2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}


layer {
  name: "batch_norm2"
  type: "BatchNorm"
  bottom: "pool2"
  top: "batch_norm2"
  param {
    lr_mult:0
  }
  param {
    lr_mult:0
  }
  param {
    lr_mult:0
  }
  batch_norm_param {    
    #use_global_stats: false
    #moving_average_fraction: 0.999
    #eps: 1e-5
  }
}



layer {
  name: "conv3"
  type: "GaussianConv"
  bottom: "batch_norm2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 500
    decay_mult: 0
  }
  param {
    lr_mult: 500
    decay_mult: 0
  }
  param {
    lr_mult: 50
    decay_mult: 0
  }
  
  # dummy - old depricated paramater
  param {
    lr_mult: 0
    decay_mult: 0
  }
  # bias
  param {
    lr_mult: 1
    #decay_mult: 1
  }
  # set zero learning rate for blobs that are for debuging only
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  
  convolution_param {
    engine: CUDNN
    number_gauss: 2
    num_output: 192
    pad: 4
    kernel_size: 9
    stride: 1
    
    gmm_weight_normalization: false
    gmm_gauss_normalization: true # wasnt tried before when got 45%
    gmm_mean_iteration_step: 1
    gmm_sigma_iteration_step: 1
    gmm_sigma_lower_bound: 0.5
    gmm_component_border_bound: 1.5
    
    weight_filler {
      type: "gaussian"
      #std: 0.058 # sqrt(1/(num-gauss*num-subfeatures)) for 2x2
      std: 0.01
      mean: 0
      #type: "constant"
      #value: 1
    }
    mu_filler {
      type: "uniform"
      min: 2
      max: 8
    }
    sigma_filler {
      type: "constant"
      #value: 0.1
      value: 0.8
      #value: 1.8
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "relu3"
}
#layer {
#  name: "pool3"
#  type: "Pooling"
#  bottom: "relu3"
#  top: "pool3"
#  pooling_param {
#    pool: AVE
#    kernel_size: 3
#    stride: 2
#  }
#}


layer {
  name: "batch_norm3"
  type: "BatchNorm"
  bottom: "relu3"
  top: "batch_norm3"
  param {
    lr_mult:0
  }
  param {
    lr_mult:0
  }
  param {
    lr_mult:0
  }
  batch_norm_param {    
    #use_global_stats: false
    #moving_average_fraction: 0.999
    #eps: 1e-5
  }
}



layer {
  name: "conv4"
  type: "GaussianConv"
  bottom: "batch_norm3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 500
    decay_mult: 0
  }
  param {
    lr_mult: 500
    decay_mult: 0
  }
  param {
    lr_mult: 50
    decay_mult: 0
  }
  
  # dummy - old depricated paramater
  param {
    lr_mult: 0
    decay_mult: 0
  }
  # bias
  param {
    lr_mult: 1
    #decay_mult: 1
  }
  # set zero learning rate for blobs that are for debuging only
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  
  convolution_param {
    engine: CUDNN
    number_gauss: 2
    num_output: 192
    pad: 4
    kernel_size: 9
    stride: 1
    
    gmm_weight_normalization: false
    gmm_gauss_normalization: true # wasnt tried before when got 45%
    gmm_mean_iteration_step: 1
    gmm_sigma_iteration_step: 1
    gmm_sigma_lower_bound: 0.5
    gmm_component_border_bound: 1.5
    
    weight_filler {
      type: "gaussian"
      #std: 0.058 # sqrt(1/(num-gauss*num-subfeatures)) for 2x2
      std: 0.01
      mean: 0
      #type: "constant"
      #value: 1
    }
    mu_filler {
      type: "uniform"
      min: 2
      max: 8
    }
    sigma_filler {
      type: "constant"
      #value: 0.1
      value: 0.8
      #value: 1.8
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "relu4"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "relu4"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "batch_norm4"
  type: "BatchNorm"
  bottom: "pool4"
  top: "batch_norm4"
  param {
    lr_mult:0
  }
  param {
    lr_mult:0
  }
  param {
    lr_mult:0
  }
  batch_norm_param {    
    #use_global_stats: false
    #moving_average_fraction: 0.999
    #eps: 1e-5
  }
}

layer {
  name: "conv5"
  type: "GaussianConv"
  bottom: "batch_norm4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 500
    decay_mult: 0
  }
  param {
    lr_mult: 500
    decay_mult: 0
  }
  param {
    lr_mult: 50
    decay_mult: 0
  }
  
  # dummy - old depricated paramater
  param {
    lr_mult: 0
    decay_mult: 0
  }
  # bias
  param {
    lr_mult: 1
    #decay_mult: 1
  }
  # set zero learning rate for blobs that are for debuging only
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  
  convolution_param {
    engine: CUDNN
    number_gauss: 2
    num_output: 128 #192
    pad: 4
    kernel_size: 9
    stride: 1
    
    gmm_weight_normalization: false
    gmm_gauss_normalization: true # wasnt tried before when got 45%
    gmm_mean_iteration_step: 1
    gmm_sigma_iteration_step: 1
    gmm_sigma_lower_bound: 0.5
    gmm_component_border_bound: 1.5
    
    weight_filler {
      type: "gaussian"
      #std: 0.058 # sqrt(1/(num-gauss*num-subfeatures)) for 2x2
      std: 0.01
      mean: 0
      #type: "constant"
      #value: 1
    }
    mu_filler {
      type: "uniform"
      min: 2
      max: 8
    }
    sigma_filler {
      type: "constant"
      #value: 0.1
      value: 0.8
      #value: 1.8
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "relu5"
}



layer {
  name: "batch_norm5"
  type: "BatchNorm"
  bottom: "relu5"
  top: "batch_norm5"
  param {
    lr_mult:0
  }
  param {
    lr_mult:0
  }
  param {
    lr_mult:0
  }
  batch_norm_param {    
    #use_global_stats: false
    #moving_average_fraction: 0.999
    #eps: 1e-5
  }
}

layer {
  name: "conv6"
  type: "GaussianConv"
  bottom: "batch_norm5"
  top: "conv6"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 500
    decay_mult: 0
  }
  param {
    lr_mult: 500
    decay_mult: 0
  }
  param {
    lr_mult: 50
    decay_mult: 0
  }
  
  # dummy - old depricated paramater
  param {
    lr_mult: 0
    decay_mult: 0
  }
  # bias
  param {
    lr_mult: 1
    #decay_mult: 1
  }
  # set zero learning rate for blobs that are for debuging only
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  param { lr_mult: 0 }
  
  convolution_param {
    engine: CUDNN
    number_gauss: 2
    num_output: 128 #192
    pad: 4
    kernel_size: 9
    stride: 1
    
    gmm_weight_normalization: false
    gmm_gauss_normalization: true # wasnt tried before when got 45%
    gmm_mean_iteration_step: 1
    gmm_sigma_iteration_step: 1
    gmm_sigma_lower_bound: 0.5
    gmm_component_border_bound: 1.5
    
    weight_filler {
      type: "gaussian"
      #std: 0.058 # sqrt(1/(num-gauss*num-subfeatures)) for 2x2
      std: 0.01
      mean: 0
      #type: "constant"
      #value: 1
    }
    mu_filler {
      type: "uniform"
      min: 2
      max: 8
    }
    sigma_filler {
      type: "constant"
      #value: 0.1
      value: 0.8
      #value: 1.8
    }
    bias_filler {
      type: "constant"
    }
  }
}


layer {
  name: "relu6"
  type: "ReLU"
  bottom: "conv6"
  top: "relu6"
}

layer {
  name: "batch_norm6"
  type: "BatchNorm"
  bottom: "relu6"
  top: "batch_norm6"
  param {
    lr_mult:0
  }
  param {
    lr_mult:0
  }
  param {
    lr_mult:0
  }
  batch_norm_param {    
    #use_global_stats: false
    #moving_average_fraction: 0.999
    #eps: 1e-5
  }
}
layer {
  name: "conv7"
  type: "Convolution"
  bottom: "batch_norm6"
  top: "conv7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
  }
  convolution_param {
    num_output: 10
    pad: 1
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "conv7"
  top: "relu7"
}


layer {
  name: "pool7"
  type: "Pooling"
  bottom: "relu7"
  top: "pool7"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "pool7"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "pool7"
  bottom: "label"
  top: "loss"
}
